app/controllers/publisher_controller.rb

SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def shops
    publisher = Publisher.find(params[:id])